In [2]:
import numpy as np
import pandas as pd

In [3]:
s=pd.Series([1,3,5, np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates=pd.date_range("20130101",periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.103024  1.873064 -0.696802  1.296974
2013-01-02 -1.260490 -2.417482 -1.099263 -2.578614
2013-01-03 -1.560524  0.626060 -1.476081  0.314460
2013-01-04 -0.418018 -0.079648 -0.453561 -0.622587
2013-01-05  0.162770 -0.375901  0.115226 -1.226035
2013-01-06  1.692054 -0.965999  0.665037  0.321628

In [6]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
df.to_numpy()

array([[-1.10302369,  1.8730645 , -0.69680191,  1.2969741 ],
       [-1.26048969, -2.41748183, -1.09926252, -2.57861427],
       [-1.56052373,  0.62605955, -1.4760813 ,  0.3144599 ],
       [-0.41801835, -0.07964777, -0.45356096, -0.62258727],
       [ 0.16277044, -0.37590099,  0.11522622, -1.2260348 ],
       [ 1.69205427, -0.96599865,  0.66503702,  0.32162814]])

In [8]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.414538 -0.223318 -0.490907 -0.415696
std    1.206147  1.450939  0.785882  1.370232
min   -1.560524 -2.417482 -1.476081 -2.578614
25%   -1.221123 -0.818474 -0.998647 -1.075173
50%   -0.760521 -0.227774 -0.575181 -0.154064
75%    0.017573  0.449633 -0.026971  0.319836
max    1.692054  1.873064  0.665037  1.296974

In [9]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.103024   -1.260490   -1.560524   -0.418018    0.162770    1.692054
B    1.873064   -2.417482    0.626060   -0.079648   -0.375901   -0.965999
C   -0.696802   -1.099263   -1.476081   -0.453561    0.115226    0.665037
D    1.296974   -2.578614    0.314460   -0.622587   -1.226035    0.321628

In [10]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  1.296974 -0.696802  1.873064 -1.103024
2013-01-02 -2.578614 -1.099263 -2.417482 -1.260490
2013-01-03  0.314460 -1.476081  0.626060 -1.560524
2013-01-04 -0.622587 -0.453561 -0.079648 -0.418018
2013-01-05 -1.226035  0.115226 -0.375901  0.162770
2013-01-06  0.321628  0.665037 -0.965999  1.692054

In [11]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -1.260490 -2.417482 -1.099263 -2.578614
2013-01-06  1.692054 -0.965999  0.665037  0.321628
2013-01-05  0.162770 -0.375901  0.115226 -1.226035
2013-01-04 -0.418018 -0.079648 -0.453561 -0.622587
2013-01-03 -1.560524  0.626060 -1.476081  0.314460
2013-01-01 -1.103024  1.873064 -0.696802  1.296974

In [12]:
df.loc[dates[0]]

A   -1.103024
B    1.873064
C   -0.696802
D    1.296974
Name: 2013-01-01 00:00:00, dtype: float64

In [13]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -1.103024  1.873064
2013-01-02 -1.260490 -2.417482
2013-01-03 -1.560524  0.626060
2013-01-04 -0.418018 -0.079648
2013-01-05  0.162770 -0.375901
2013-01-06  1.692054 -0.965999

In [14]:
df.loc["20130102":"20130103",["A","B"]]

                   A         B
2013-01-02 -1.260490 -2.417482
2013-01-03 -1.560524  0.626060

# Title : Groupby

In [15]:
df.groupby('A').agg({'B': ['min', 'max'], 'C': 'sum'})

                  B                   C
                min       max       sum
A
-1.560524  0.626060  0.626060 -1.476081
-1.260490 -2.417482 -2.417482 -1.099263
-1.103024  1.873064  1.873064 -0.696802
-0.418018 -0.079648 -0.079648 -0.453561
 0.162770 -0.375901 -0.375901  0.115226
 1.692054 -0.965999 -0.965999  0.665037

In [17]:
import pandas as pd
tips.to_excel("E:/Data Science with Python/Learn/tips_export.xlsx",index=False)

AttributeError: module 'pandas' has no attribute 'to_excel'